import { parseChat } from "parser";

it("basic", () => {
  const text = `
消息记录（此消息记录为文本格式，不支持重新导入）

================================================================
消息分组:我的群聊
================================================================
消息对象:湖之仆从（PST 8pm | BJT 11am）
================================================================

2019-09-23 8:43:38 PM 骰娘-Roll100(872001750)
1

2019-09-23 8:43:38 PM 系统消息(10000)
[图片]2

2019-09-23 8:44:09 PM 系统消息(1000000)
3

2019-09-23 8:46:18 PM 暗夜(280848250)


2019-09-23 8:49:12 PM 系统消息(1000000)
真核生物独幕剧加入本群。

2019-09-23 9:02:42 PM 暗夜(280848250)
.r test

2019-09-23 11:26:00 PM 岁寒(362264070)
4

2019-09-24 7:54:29 AM 黄山真君(1065057234)
5

2019-09-24 9:16:35 AM 黄山真君(1065057234)
6
  `;
  expect(
    parseChat(text, {
      commandFilter: false,
      otherFilter: false,
      picTextFilter: false,
      timeSwitch: false,
      nnameSwitch: false
    })
  ).toMatchSnapshot();
});
